# SetColorSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..SetColorSettings Method
AnalysisDisplayStyle Class See Also
---
Set color settings object for the style.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetColorSettings(
	AnalysisDisplayColorSettings colorSettings
)
```

Visual Basic
---
```text
Public Sub SetColorSettings ( _
	colorSettings As AnalysisDisplayColorSettings _
)
```

Visual C++
---
```text
public:
void SetColorSettings(
	AnalysisDisplayColorSettings^ colorSettings
)
```

# ### Parameters
colorSettings
    Type: Autodesk.Revit.DB.Analysis..::..AnalysisDisplayColorSettings
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | for Diagram display style, colorSettings must have type SolidColorRanges and exactly one intermediate entry with zero value |

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace